# GetDropShadowData

## Description
```pascal
FUNCTION GetDropShadowData(
				h               : HANDLE;
				VAR nUnits      : INTEGER;
				VAR dOffset     : REAL;
				VAR dBlurRadius : REAL;
				VAR dAngle      : REAL;
				VAR nOpacity    : INTEGER;
				VAR colorRV     : INTEGER;
				VAR colorGV     : INTEGER;
				VAR colorBV     : INTEGER) : BOOLEAN;
```

```python

def vs.GetDropShadowData(h):
    return (BOOLEAN, nUnits, dOffset, dBlurRadius, dAngle, nOpacity, colorRV, colorGV, colorBV)
```

## Parameters
|Name|Type|Description|
|---|---|---|
|h|HANDLE||
|nUnits|INTEGER||
|dOffset|REAL||
|dBlurRadius|REAL||
|dAngle|REAL||
|nOpacity|INTEGER||
|colorRV|INTEGER||
|colorGV|INTEGER||
|colorBV|INTEGER||

## Version
Availability: from Vectorworks 2017
## Category
* Object Attributes